Картриджи/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <attributes>
    <name>ВидДанных</name>
    <comment>Вид данных</comment>
    <type>
      <types>EnumRef.ВидыДополнительнойИнформацииОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектХранилища</name>
    <type>
      <types>CatalogRef.Принтера</types>
      <types>CatalogRef.ОбслуживаниеПринтеров</types>
      <types>CatalogRef.МоделиКартриджей</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <comment>Хранилище</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Картриджи/src/Catalogs/Файлы/Forms/ФормаСпискаИзображений/Module.bsl
&НаСервере
Процедура УстановитьКартинку(Изображение)
	
	КартинкаАдрес = ПолучитьНавигационнуюСсылку(Изображение,"Хранилище");
	Элементы.Картинка.РазмерКартинки = РазмерКартинки.АвтоРазмер;

КонецПроцедуры // УстановитьКартинку() 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("ОсновноеИзображение") Тогда
		Если ЗначениеЗаполнено(Параметры.ОсновноеИзображение.ИмяФайла) Тогда
			ОсновноеИзображение = Параметры.ОсновноеИзображение;
		Иначе	
		    ОсновноеИзображение = Неопределено;
		КонецЕсли; 				
	КонецЕсли; 
	
	Если Параметры.Свойство("ОбъектХранилища") Тогда
		ОбъектХранилища = Параметры.ОбъектХранилища;		
	КонецЕсли;
	
	СписокИзображений.Параметры.УстановитьЗначениеПараметра("ОсновноеИзображение",ОсновноеИзображение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеИзображение(Команда)
	
	Если Не Команда = 0 Тогда
		
		ТекущиеДанные = Элементы.СписокИзображений.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;	
		КонецЕсли;
		
		ОсновноеИзображение = ТекущиеДанные.Ссылка;
		
	КонецЕсли;   
		
	СписокИзображений.Параметры.УстановитьЗначениеПараметра("ОсновноеИзображение",ОсновноеИзображение);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ОбъектХранилища"    ,ОбъектХранилища);
	ПараметрыОповещения.Вставить("ОсновноеИзображение",ОсновноеИзображение);
	
	Оповестить("ОбновитьОсновноеИзображение", ПараметрыОповещения, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИзображенийПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокИзображений.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		КартинкаАдрес = "";
		Возврат;	
	КонецЕсли; 
	
	УстановитьКартинку(ТекущиеДанные.Ссылка);
	
КонецПроцедуры
    
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	  
	Если ИмяСобытия = "УстановитьОсновноеИзображениеЕслиЕгоНет" Тогда
		Если Параметр = ОбъектХранилища Тогда
			Если Не ЗначениеЗаполнено(ОсновноеИзображение) 
			   И ТипЗнч(Источник) = Тип("СправочникСсылка.Файлы")	
			   И ЗначениеЗаполнено(Источник) Тогда
			   
			   ОсновноеИзображение = Источник;
			   ОсновноеИзображение(0);
			
			КонецЕсли; 
		
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура СписокИзображенийПослеУдаления(Элемент)
	
	ОсновноеИзображение(0);
	
КонецПроцедуры
